<div style="padding: 60px;
  text-align: center;
  background: #a0ced9;
  color: #003049;
  font-size: 20px;">
  <h2>Inclass: Python for Data Analysts</h2>
   <hr>
</div>


- **This notebook based on main material**
- **Course Length**: 12 hours
- **Instructor** : Dwi Gustin Nurdialit
- **Version**: Zeus Data Analytics - August 2024

___

**Table of contents**<a id='toc0_'></a>    
- [Training Objectives](#toc1_1_)    
- [Environment](#toc2_)    
  - [Cara Membuat Environtment Baru](#toc2_1_)    
  - [Install/ Update Package](#toc2_2_)    
- [Introduction to Jupyter Notebook in VS Code](#toc3_)    
  - [Markdown Cell and Code Cell](#toc3_1_)    
    - [Markdown](#toc3_1_1_)    
    - [Code](#toc3_1_2_)    
  - [Shortcuts](#toc3_2_)    
  - [üèÑüèª‚Äç‚ôÄÔ∏è Dive Deeper](#toc3_3_)    
- [Introduction to Python](#toc4_)    
  - [Variables](#toc4_1_)    
  - [Python Data Types](#toc4_2_)    
    - [String](#toc4_2_1_)    
    - [Number](#toc4_2_2_)    
    - [Boolean](#toc4_2_3_)    
    - [List](#toc4_2_4_)    
- [Introduction to Library (Package)](#toc5_)    
  - [Import a Library](#toc5_1_)    
- [Pandas Library](#toc6_)    
  - [Working with DataFrame](#toc6_1_)    
    - [üèÑüèª‚Äç‚ôÄÔ∏è Dive Deeper](#toc6_1_1_)    
- [Exploratory Data Analysis I](#toc7_)    
  - [`head()` and `tail()`](#toc7_1_)    
  - [`shape` dan `size`](#toc7_2_)    
  - [`axes`](#toc7_3_)    
  - [`.describe()`](#toc7_4_)    
  - [Tipe Data](#toc7_5_)    
  - [`dtypes`: Check Tipe Data](#toc7_6_)    
    - [Numerical and Categorical Variables](#toc7_6_1_)    
      - [Numerical](#toc7_6_1_1_)    
      - [Object & Categorical](#toc7_6_1_2_)    
    - [Mengubah Tipe Data](#toc7_6_2_)    
    - [Rangkuman Data Types](#toc7_6_3_)    
  - [Knowledge Check: Data types](#toc7_7_)    
    - [Summary Day-2](#toc7_7_1_)    
- [Indexing and Subsetting with Pandas](#toc8_)    
  - [`select_dtypes()`](#toc8_1_)    
  - [`drop()`](#toc8_2_)    
    - [Hapus berdasarkan index baris](#toc8_2_1_)    
    - [Hapus berdasarkan index kolom](#toc8_2_2_)    
  - [Slicing: **`[]` operator**](#toc8_3_)    
  - [`.iloc` dan `.loc`](#toc8_4_)    
      - [üèÑüèª‚Äç‚ôÄÔ∏è Dive Deeper:](#toc8_4_1_1_)    
  - [Conditional Subsetting](#toc8_5_)    
  - [Multiple Conditions](#toc8_6_)    
  - [üèÑüèª‚Äç‚ôÄÔ∏è Dive Deeper](#toc8_7_)    
- [Referencing and Copying](#toc9_)    
  - [Reference](#toc9_1_)    
  - [Copying](#toc9_2_)    
- [Additional Information](#toc10_)    
    - [Cara Membuat Kolom Baru](#toc10_1_1_)    
- [Inclass Questions](#toc11_)    

<!-- vscode-jupyter-toc-config
	numbering=false
	anchor=true
	flat=false
	minLevel=1
	maxLevel=6
	/vscode-jupyter-toc-config -->
<!-- THIS CELL WILL BE REPLACED ON TOC UPDATE. DO NOT WRITE YOUR TEXT IN THIS CELL -->

## <a id='toc1_1_'></a>[Training Objectives](#toc0_)

This coursebook is intended for participants new to the world of data analysis and / or programming. No prior programming knowledge is assumed. 

The coursebook focuses on:
- Introduction to the `pandas` library. 
- Introduction to `DataFrame`  
- Data Types
- Exploratory Data Analysis I
- Indexing and Subsetting

The final part of this course is a Graded Asssignment, where you are expected to apply all that you've learned on a new dataset, and attempt the given questions.

Dear Bapak/Ibu berikut tahapan dari awal yang perlu dilakukan: 
(((lakukan secara berurutan)))
------
Tata cara mengubah PowerShell ke Command Prompt
1. Pada keyboard Ctrl + Shift + P
2. Cari select default profile
3. Pilih command prompt

------
Tahapan pembuatan environment
- Bisa dilakukan pada terminal vscode / anaconda prompt

1. Open terminal in VS Code
2. Pastikan terminal sudah dalam (base)
3. Create new virtual environment with:
	conda create --name zeus_da python=3.12
4. Tunggu prosesnya sampai kembali ke (base)

# <a id='toc2_'></a>[Environment](#toc0_)

## <a id='toc2_1_'></a>[Cara Membuat Environtment Baru](#toc0_)


**1Ô∏è‚É£ Membuka Terminal pada Visual Studio Code**

Saat pertama kali kita membuka Visual Studio Code, terdapat beberapa menu di pojok kiri atas. Silahkan kamu klik menu **Terminal** pada bagian kiri atas. Lalu, pilih **`New Terminal`**. Selesai, kamu berhasil membuka terminal baru.

---

**2Ô∏è‚É£ Buat Environment dengan Nama `ENV_NAME`**:
   
```python
conda create -n <ENV_NAME> python=<PYTHON_VERSION>
```
Contoh: `conda create -n zeus_da python==3.12`

Tujuan dari kita menuliskan `python==3.12` agar python yang terinstall pada virtual environtment yang kita buat adalah python dengan versi 3.12. 

---

**3Ô∏è‚É£ Mengaktifkan Environment**

Setelah virtual environtment yang baru kita buat sudah selesai, kita bisa mengaktifkan environtment yang sudah kita buat dengan code berikut.

```python
conda activate <ENV_NAME>
```

Contoh: `conda activate zeus_da`

**Perintah `conda` yang sering digunakan:**

- `conda env list`: cek daftar **environment** pada Anaconda
- `conda list`: cek daftar **package** di dalam sebuah environment

Referensi perintah lain: https://docs.conda.io/projects/conda/en/latest/commands.html

## <a id='toc2_2_'></a>[Install/ Update Package](#toc0_)
Sebelum melakukan instalasi package, pastikan Anda sudah melakukan aktivasi virtual environment tempat Anda mau menginstall package.
```python
pip install <PACKAGE_NAME>
```
Contoh: `pip install pandas==2.2.2`

---

Sebenarnya kita bisa memiliki **2 opsi** untuk menginstal package/library Python karena kita menggunakan Miniconda :
1. **pip** \
Package manager yang digunakan untuk menginstal package dari [Python Package Index](https://pypi.org/) dan indeks lainnya.
2. **conda** \
Package manager yang digunakan untuk menginstal package dari [Anaconda Package Repository](https://anaconda.org/anaconda/repo).

Namun, memang `pip` yang paling sering mengikuti update dan sering digunakan.

**‚ú® Additional: Perintah yang Sering Digunakan:**
- `pip install --upgrade <PACKAGE_NAME>`: cara update package dari `pip`
- `conda env list`: cek daftar **environment** pada Anaconda
- `pip list`: cek daftar **package** di dalam sebuah environment

# <a id='toc3_'></a>[Introduction to Jupyter Notebook in VS Code](#toc0_)

- [Dokumentasi: Jupyter Notebook di VS Code](https://code.visualstudio.com/docs/datascience/jupyter-notebooks#_setting-up-your-environment)

## <a id='toc3_1_'></a>[Markdown Cell and Code Cell](#toc0_)

Tipe cell dalam notebook:
1. Markdown
2. Code

narasi, gambar,

**tebal**
*miring*

1. satu
2. dua

- satu
- dua

In [1]:
3*5

15

In [2]:
1*2

2

In [3]:
4+9

13

### <a id='toc3_1_1_'></a>[Markdown](#toc0_)

> - Digunakan untuk menambahkan teks format dan dokumentasi
> - Tata cara penulisannya menggunakan sintaks markdown
> - [Cheat sheet markdown](https://www.markdownguide.org/cheat-sheet/)

### <a id='toc3_1_2_'></a>[Code](#toc0_)

> - Digunakan untuk menulis dan menjalankan kode python
> - Hanya bisa ditulis dengan kode python
> - Akan mengeluarkan output apabila menjalankan suatu kode yang dapat mengeluarkan output

## <a id='toc3_2_'></a>[Shortcuts](#toc0_)

- `Ctrl+S`: Simpan

1. Command mode
    - `a` : Tambahkan sel di atas
    - `b` : Tambahkan sel di bawah
    - `d` + `d` : Hapus sel yang dipilih
    - `x` : Cut sel yang dipilih
    - `c` : Copy sel yang dipilih
    - `v` : Paste sel yang dipilih
    - `z` : Undo 
    - `m` : Ubah jenis sel ke Markdown
    - `y` : Ubah jenis sel ke kode
    - `enter` : enter Edit Mode


2. Edit mode
    - `Ctrl+Enter`: Jalankan sel yang saat ini dipilih
    - `Shift+Enter`: Jalankan sel yang saat ini dipilih dan sisipkan sel baru di bawahnya (fokus beralih ke sel baru)
    - `Alt+Enter`: Jalankan sel yang saat ini dipilih dan sisipkan sel baru di bawahnya (fokus tetap pada sel saat ini)
    - `Esc`: Mengubah edit mode menjadi command mode

## <a id='toc3_3_'></a>[üèÑüèª‚Äç‚ôÄÔ∏è Dive Deeper](#toc0_)

Replikasilah `jupyter_notebook_practice.html` menggunakan notebook kosongan dan submit file `.ipynb` beserta `.html` ke assignment Google Classroom.

-----------

# <a id='toc4_'></a>[Introduction to Python](#toc0_)

## <a id='toc4_1_'></a>[Variables](#toc0_)

**Variable** adalah sebuah nama yang dipakai untuk menunjukkan sebuah nilai. Tanda `=` dipakai untuk membuat variable baru. Proses ini sering disebut sebagai **assignment**.

In [4]:
4*100

400

In [5]:
# code here
panjang = 4*100

In [6]:
panjang*50

20000

In [7]:
panjang

400

<div class="alert-info alert">
<h5><b>Case Sensitive</b></h5>
üí° Python adalah bahasa pemrograman yang <b>case-sensitive</b> sehingga penamaan variable menjadi hal yang perlu diperhatikan.

`kota` dengan awalan huruf `k` kecil **TIDAK SAMA** dengan `Kota` yang diawali dengan huruf `K` besar.
</div>

In [8]:
# code here
luas2 = panjang*1000

In [9]:
luas_persegi = panjang*1000

print(100)
print(panjang)

100
400

Berikut beberapa anjuran dalam memberikan nama variable pada Python:
- Menggunakan kombinasi dari huruf kapital (A-Z), huruf nomina (a-z), angka (0-9).
- Special character `!, $ , &, dll` tidak dapat digunakan dalam penamaan variabel.
- Tidak boleh menggunakan angka di awal.
- Tidak boleh menggunakan keyword pada Python
- Bersifat case-sensitive sehingga penamaan variable `algoritma`, `ALGORITMA`, dan `Algoritma` adalah 3 variable yang berbeda

<div class="alert alert-info">
  <b>üí° Keywords</b>
    <p>adalah kata kunci yang sudah ditetapkan oleh Python sebagai nama yang tidak bisa dipakai baik untuk penamaan fungsi, variabel, dan lainnya. Keyword ditulis dalam lower-case (huruf kecil semua) kecuali keyword <code>True</code>, <code>False</code>, dan <code>None</code>. Sejauh ini (Python 3.10) keyword yang ada pada Python adalah sebagai berikut:</p>
</div>

In [10]:
panjang

400

In [11]:
# Cek daftar keyword
import keyword
keyword.kwlist

['False',
 'None',
 'True',
 'and',
 'as',
 'assert',
 'async',
 'await',
 'break',
 'class',
 'continue',
 'def',
 'del',
 'elif',
 'else',
 'except',
 'finally',
 'for',
 'from',
 'global',
 'if',
 'import',
 'in',
 'is',
 'lambda',
 'nonlocal',
 'not',
 'or',
 'pass',
 'raise',
 'return',
 'try',
 'while',
 'with',
 'yield']

In [12]:
100

100

## <a id='toc4_2_'></a>[Python Data Types](#toc0_)

### <a id='toc4_2_1_'></a>[String](#toc0_)

Python mewakili string apa pun sebagai objek `str`. Ada beberapa cara untuk membuat nilai string:

- menggunakan `''` (yaitu: `'cyber punk 2077'`)
- menggunakan `""` (yaitu : `"Hari Jum'at"`)
- menggunakan `'''` atau `"""` (yaitu: `'''Andi berkata "Jum'at Bersih"'''`)

In [13]:
kota = 'Jakarta 1995'

### <a id='toc4_2_2_'></a>[Number](#toc0_)

Untuk menyimpan number, python memiliki dua tipe data asli yang disebut `int` dan `float`.
- `int` digunakan untuk menyimpan bilangan bulat (yaitu: 1,2,-3)
- `float` digunakan untuk menyimpan bilangan real (yaitu: 0.7, -1.8, -1000.0).

In [14]:
-0.5

-0.5

In [15]:
# pembagian pembulatan
5//2

2

**Operasi Angka** \
Operator Aritmatika:
- `+` - Penambahan
- `-` - Pengurangan
- `*` - Perkalian
- `/` - Divisi
- `//` - Pembagian Putaran
- `%` - Modul
- `**` - Eksponen

Operator Perbandingan:
- `<` - Lebih kecil dari (yaitu : a < b)
- `<=` - Lebih kecil atau sama dengan (yaitu : a <= b)
- `>` - Lebih besar dari (yaitu: a > b)
- `>=` - Lebih besar atau sama dengan (yaitu: a >= b)
- `==` - Sama dengan (yaitu: a == b)
- `!=` - Tidak Sama dengan (yaitu: a != b)

### <a id='toc4_2_3_'></a>[Boolean](#toc0_)

Boolean menyimpan nilai yang sangat sederhana dalam komputer dan pemrograman, `True` atau `False`.

In [16]:
x = True 
y = False

In [17]:
x

True

**Operasi Boolean** \
Python menyediakan operator logika seperti:
- and (yaitu: a and b)
- or (yaitu: a or c)
- not (yaitu: not a)

### <a id='toc4_2_4_'></a>[List](#toc0_)

`list` digunakan untuk menyimpan beberapa nilai dalam python. Untuk membuatnya, cukup letakkan nilai di dalam tanda kurung (yaitu: `x = [1,2,3]` )

In [18]:
kota = ['Jakarta', 'Bogor']

In [19]:
kota

['Jakarta', 'Bogor']

In [20]:
x = [1,2,3,4,5]
y = [2,3,4,5,6]

In [21]:
print(x)
print(y)

[1, 2, 3, 4, 5]
[2, 3, 4, 5, 6]

In [22]:
kota[0]

'Jakarta'

di python, zero based indexing -> index nya dimulai dari 0

**Operasi List**
- `x.append(a)` : tambahkan a ke x
- `x.remove(a)` : hapus a dari x

Selain operator yang dikenal sebelumnya, salah satu list yang paling berguna adalah dengan menerapkan fungsi agregasi seperti:
- `len(x)` : ekstrak panjang daftar
- `a in b` : memeriksa apakah nilai `a` ada di objek daftar `b`
- `max(x)` : mendapatkan nilai tertinggi dalam x
- `sum(x)` : mendapatkan jumlah nilai dalam x

Operasi lain yang harus diketahui dalam daftar adalah pengindeksan:
- `x[i]` : mengakses elemen ke-i dari x

# <a id='toc5_'></a>[Introduction to Library (Package)](#toc0_)

## <a id='toc5_1_'></a>[Import a Library](#toc0_)

In [23]:
# code here
import pandas as pd

# <a id='toc6_'></a>[Pandas Library](#toc0_)
## <a id='toc6_1_'></a>[Working with DataFrame](#toc0_)

`pandas` adalah library yang powerful sebagai tools analisis data dan struktur pada Python. Dengan `pandas`, mengolah data menjadi mudah karena disediakan salah satu objek bernama **DataFrame**. Dengan dataframe kita dapat membaca sebuah file, mengolah suatu data dengan menggunakan operasi seperti join, distinct, group by, agregasi, dan teknik lainnya.

> Lebih lengkapnya silahkan kunjungi [official documentation](https://pandas.pydata.org/)

Semua method pada `pandas` dapat dipanggil dengan syntax seperti: `pandas.function_name()`. Langkah pertama yang akan kita lakukan adalah membaca data. Kita dapat menggunakan method `.read_csv()` untuk membaca sebuah file dengan format `.csv`.

In [24]:
# code ini untuk mengatur pemisah angka ribuan
pd.options.display.float_format = '{:,.0f}'.format

In [25]:
# read data
rice = pd.read_csv('data_input/rice.csv')

In [26]:
rice

,Unnamed: 0,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
0,1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
1,2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07
2,3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",0,3,2018-07
3,4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,"65,000",0,1,2018-07
4,5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",0,1,2018-07
...,...,...,...,...,...,...,...,...,...,...,...
11995,11996,5760491,17555486,12/15/2017 21:06,Rice,Rice,supermarket,"128,000",0,1,2017-12
11996,11997,5598782,16999147,12/2/2017 14:12,Rice,Rice,minimarket,"64,000",0,1,2017-12
11997,11998,5735850,17434503,12/13/2017 19:17,Rice,Rice,supermarket,"59,990",3000,1,2017-12
11998,11999,5678748,17317935,12/8/2017 22:04,Rice,Rice,minimarket,"59,500",3000,1,2017-12
11999,12000,5702411,17341559,12/10/2017 17:04,Rice,Rice,minimarket,"59,500",3000,1,2017-12

üîª Kita coba set kolom pertama `Unnamed: 0` menjadi index dari dataframe, dengan cara menambahkan **parameter** `index_col=0`.

In [27]:
# code here
rice = pd.read_csv('data_input/rice.csv', index_col='Unnamed: 0')
rice

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",0,3,2018-07
4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,"65,000",0,1,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",0,1,2018-07
...,...,...,...,...,...,...,...,...,...,...
11996,5760491,17555486,12/15/2017 21:06,Rice,Rice,supermarket,"128,000",0,1,2017-12
11997,5598782,16999147,12/2/2017 14:12,Rice,Rice,minimarket,"64,000",0,1,2017-12
11998,5735850,17434503,12/13/2017 19:17,Rice,Rice,supermarket,"59,990",3000,1,2017-12
11999,5678748,17317935,12/8/2017 22:04,Rice,Rice,minimarket,"59,500",3000,1,2017-12
12000,5702411,17341559,12/10/2017 17:04,Rice,Rice,minimarket,"59,500",3000,1,2017-12

üìå Instuctor notes

> kolom yang dijadikan sebagai index biasanya adalah kolom yang antar barisnya memiliki nilai unik atau suatu identifier

Intuisi dari parameter `index_col` pada `read_csv()` adalah menjadikan kolom pada Dataframe sebagai index pada baris. Berikut beberapa nilai yang dapat ditampung oleh parameter `index_col`.
- (0, 1, 2, dst) : Menunjukkan index kolom yang akan dijadikan sebagai index baris.
- `'nama_kolom'` : Selain menggunakan nilai index nya, kita juga dapat langsung mengetikkan nama kolomnya.
- `False` : Menggunakan index yang disediakan oleh `pandas`.

**üìå Additional Information:**

1. Python menggunakan sistem **zero based indexing** yang berarti, index pada python dimulai dari angka 0.
2. Terdapat beberapa parameter dalam method `.read_csv()`, dokumentasi selengkapnya ada [di sini](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html)

### <a id='toc6_1_1_'></a>[üèÑüèª‚Äç‚ôÄÔ∏è Dive Deeper](#toc0_)

baca data rice kembali dengan mengatur kolom `receipt_id` sebagai index_col, simpan kedalam suatu variabel bernama "rice_new"

In [28]:
# code here
rice_new1 = pd.read_csv('data_input/rice.csv', index_col=1)

rice_new2 = pd.read_csv('data_input/rice.csv', index_col='receipt_id')

___

____

# <a id='toc7_'></a>[Exploratory Data Analysis I](#toc0_)

Exploratory Data Analysis (**EDA**) mengacu pada proses melakukan investigasi awal pada data, seringkali dengan tujuan untuk lebih mengenal dengan karakteristik data tertentu. EDA dilakukan dengan bantuan ringkasan statistik dan teknik grafis sederhana untuk melihat struktur data yang kita miliki.

EDA:
- Cek data dengan melihat struktur/bentuk data
- Cek data dengan melihat statistika data
- Cek data dengan memvisualisasikan data


Beberapa tools sederhana pada `pandas` yang dapat digunakan untuk melakukan EDA adalah sebagai berikut:
- `.head()` and `.tail()`
- `.shape` and `.size`
- `.axes`
- `.describe()`
- `.dtypes`

## <a id='toc7_1_'></a>[`head()` and `tail()`](#toc0_)

- `head(n)` digunakan untuk inspeksi `n` data teratas dari sebuah dataframe.
- `tail(n)` digunakan untuk inspeksi `n` data terbawah dari sebuah dataframe.

In [29]:
rice.head(2)

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07

In [30]:
rice.tail()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
11996,5760491,17555486,12/15/2017 21:06,Rice,Rice,supermarket,"128,000",0,1,2017-12
11997,5598782,16999147,12/2/2017 14:12,Rice,Rice,minimarket,"64,000",0,1,2017-12
11998,5735850,17434503,12/13/2017 19:17,Rice,Rice,supermarket,"59,990",3000,1,2017-12
11999,5678748,17317935,12/8/2017 22:04,Rice,Rice,minimarket,"59,500",3000,1,2017-12
12000,5702411,17341559,12/10/2017 17:04,Rice,Rice,minimarket,"59,500",3000,1,2017-12

## <a id='toc7_2_'></a>[`shape` dan `size`](#toc0_)

`shape` dan `size` adalah atribut dari sebuah dataframe yang memberikan informasi terkait dimensi data dan ukuran data

In [31]:
# check shape
rice.shape

(12000, 10)

üìå Notes :

In [32]:
# code here
# untuk melihat jumlah baris
rice.shape[0]

12000

In [33]:
# code here
# untuk melihat jumlah kolom
rice.shape[1]

10

___

In [34]:
# check size
rice.size

120000

___

## <a id='toc7_3_'></a>[`axes`](#toc0_)

`axes` adalah atribut dataframe yang memberikan informasi terkait index dataframe (baik index kolom maupun index baris)

In [35]:
# check axes
rice.axes

[Index([    1,     2,     3,     4,     5,     6,     7,     8,     9,    10,
        ...
        11991, 11992, 11993, 11994, 11995, 11996, 11997, 11998, 11999, 12000],
       dtype='int64', length=12000),
 Index(['receipt_id', 'receipts_item_id', 'purchase_time', 'category',
        'sub_category', 'format', 'unit_price', 'discount', 'quantity',
        'yearmonth'],
       dtype='object')]

üìù Notes :

In [36]:
# code here
# untuk melihat index baris
rice.axes[0]

Index([    1,     2,     3,     4,     5,     6,     7,     8,     9,    10,
       ...
       11991, 11992, 11993, 11994, 11995, 11996, 11997, 11998, 11999, 12000],
      dtype='int64', length=12000)

In [37]:
# code here
# untuk melihat index kolom
rice.axes[1]

Index(['receipt_id', 'receipts_item_id', 'purchase_time', 'category',
       'sub_category', 'format', 'unit_price', 'discount', 'quantity',
       'yearmonth'],
      dtype='object')

___

## <a id='toc7_4_'></a>[`.describe()`](#toc0_)

Method `describe()` menampilkan 8 ringkasan statistika deskriptif. Secara default menampilkan ringkasan untuk kolom numerik. 

Ringkasan statistika yang dimaksud adalah sebagai berikut:
- Count: banyaknya baris pada dataframe
- Mean: rata-rata nilai
- Standard Deviation: jarak rata-rata antara data ke mean (titik pusat data)
- Minimum Value: nilai terkecil dari keseluruhan data
- 25th Percentile (Q1)
- 50th Percentile (Q2/Median)
- 75th Percentile (Q3)
- Maximum Value: nilai terbesar dari keseluruhan data

In [38]:
rice.describe()

       receipt_id  receipts_item_id  unit_price  discount  quantity
count      12,000            12,000      12,000    12,000    12,000
mean    7,650,135        24,579,496      70,013       835         1
std     1,873,838         7,171,105      29,905     6,207         1
min     3,173,994         9,282,023       9,395    -4,100         1
25%     5,983,209        18,206,938      61,900         0         1
50%     7,443,618        22,343,374      63,500         0         1
75%     9,149,786        31,083,788      66,000         0         1
max    11,463,208        38,429,394     219,400   320,000        19

Ingin melihat deskripsi kolom `unit_price`

- ambil kolom `unit_price` -> `rice['unit_price']`
- gunakan method `describe()` -> `.describe()`

In [39]:
rice['unit_price'].describe()

count    12,000
mean     70,013
std      29,905
min       9,395
25%      61,900
50%      63,500
75%      66,000
max     219,400
Name: unit_price, dtype: float64

cara 2:

In [40]:
rice.describe()['unit_price']

count    12,000
mean     70,013
std      29,905
min       9,395
25%      61,900
50%      63,500
75%      66,000
max     219,400
Name: unit_price, dtype: float64

In [41]:
# deskripsi dari data rice
rice.describe()

       receipt_id  receipts_item_id  unit_price  discount  quantity
count      12,000            12,000      12,000    12,000    12,000
mean    7,650,135        24,579,496      70,013       835         1
std     1,873,838         7,171,105      29,905     6,207         1
min     3,173,994         9,282,023       9,395    -4,100         1
25%     5,983,209        18,206,938      61,900         0         1
50%     7,443,618        22,343,374      63,500         0         1
75%     9,149,786        31,083,788      66,000         0         1
max    11,463,208        38,429,394     219,400   320,000        19

üìà  **Insight** :

Ringkasan seperti count, mean, std, min, max, dan quantile() memiliki method nya masing-masing:

In [42]:
rice['unit_price'].mean()

np.float64(70013.14631275)

___

Kita bisa menambahkan parameter `include` ataupun `exclude` pada `describe()` untuk melihat statistika deskriptif dari variable non-numeric:

In [43]:
rice.head(2)

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07

In [44]:
rice.describe(exclude='number')

         purchase_time category sub_category      format yearmonth
count            12000    12000        12000       12000     12000
unique           11609        1            1           3        12
top     6/14/2018 0:00     Rice         Rice  minimarket   2018-07
freq                 4    12000        12000        7088      1000

üìà **Insight** : 

- Untuk deskripsi dari data non-numerik kita bisa mendapatkan 4 output yaitu nilai:
  - `count`: jumlah baris
  - `unique`: jumlah nilai unik
  - `top`: nilai yang paling sering muncul
  - `freq`: frekuensi kemunculan nilai tertinggi (top)

___

### <a id='toc7_7_1_'></a>[Summary Day-2](#toc0_)

- Membuat variabel: nama yang digunakan untuk menyimpan suatu nilai, dengan menggunakan tanda assignment (=)
    - Case sensitive
    - Harus satu kata
    - Untuk nama variabel lebih dari 1 kata, dipisahkan `_`
    - Tidak boleh ada angka didepan
    - Tidak boleh ada spresial character seperti `%$^&*(#@$)`
    
- Library merupakan pustaka: kumpulan-kumpulan dari fungsi, method, attribute
- `pandas`: library yang digunakan untuk pengolahan data
    - install terlebih dahulu library pandas di terminal dengan cara: `pip install pandas`
    - memanggil library pandas --> `import pandas as pd`
    - membuka data kita --> `pd.read_csv('path')`

        
- Tools EDA:

- ‚Ä¢ üëÄ `df.head()`: Lihat 5 baris teratas.
- ‚Ä¢ üëÅÔ∏è‚Äçüó®Ô∏è `df.tail()`: Lihat 5 baris terbawah.
- ‚Ä¢ üìè `df.shape`: Jumlah baris dan kolom DataFrame.
- ‚Ä¢ üìè `df.size`: Total data (baris x kolom) DataFrame.
- ‚Ä¢ üìá `df.axes`: List index baris dan kolom DataFrame.
- ‚Ä¢ üí° `df.describe()`: summary statistic variable
  

- Tipe data:
    - Tipe data pandas:
        - Check tipe data: `.......`
        - int64, float64, object, datetime64, category
        - Mengubah tipe data menggunakan method `.......`

========================================= End of Day 2 ======================================

## <a id='toc7_5_'></a>[Tipe Data](#toc0_)

Dataframe terdiri dari beberapa **Series** (mengacu pada satu kolom). Dalam satu series harus memiliki satu tipe data yang sama. `pandas` akan mencoba untuk infer tipe data dari masing-masing Series, tapi tidak selalu benar.

## <a id='toc7_6_'></a>[`dtypes`: Check Tipe Data](#toc0_)

Cara cek tipe data: `dtypes` atau `.info()` untuk lebih lengkapnya

<div class="alert alert-secondary">
<p>
üîé Nice to Know: <b>Method vs. Atribut</b> üîé 

- Secara tampilan:

    - **method** selalu diikuti dengan tanda kurung ()
        
        Contoh : `.head()`, `.tail()`, `.read_csv()`

    - **atribut** tidak diikuti oleh tanda kurung
        
        Contoh : `.dtypes`
        
- Kepemilikan nilai/parameter yang bisa diganti-ganti

    - **method**: ‚úÖ memiliki parameter/nilai yang bisa diganti-ganti
    
        Contoh : `head(n=)` ‚û°Ô∏è parameter n bisa diganti/disesuaikan dengan jumlah baris yang mau ditampilkan
        
    - **atribut**: ‚ùå tidak ada 
</p>
</div>

In [45]:
# read data rice
rice = pd.read_csv('data_input/rice.csv', index_col=0)

In [46]:
# check tipe data
rice.dtypes

receipt_id            int64
receipts_item_id      int64
purchase_time        object
category             object
sub_category         object
format               object
unit_price          float64
discount              int64
quantity              int64
yearmonth            object
dtype: object

In [47]:
rice.head(2)

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07

### <a id='toc7_6_1_'></a>[Numerical and Categorical Variables](#toc0_)

#### <a id='toc7_6_1_1_'></a>[Numerical](#toc0_)

Terdapat dua jenis tipe data numerik, yaitu `float` dan `int`. Perhatian khusus terhadap tipe data ini sangat penting agar dapat memastikan kesesuaian dengan kebutuhan analisis. Alasannya:

**Operasi Matematika yang Akurat:**
   - Penting untuk memastikan bahwa kolom-kolom yang seharusnya berisi data numerik diidentifikasi dengan benar sebagai float atau int. Jika suatu kolom numerik tidak terbaca dengan tepat, operasi matematika seperti penjumlahan, pengurangan, perkalian, dan pembagian mungkin menghasilkan kesalahan atau hasil yang tidak akurat. Sebagai contoh, menganggap kolom numerik sebagai tipe data teks dapat mengakibatkan kesalahan perhitungan.


Dengan memahami pentingnya tipe data numerik dan memastikan identifikasi yang benar, kita dapat meminimalkan risiko kesalahan dalam analisis data dan memastikan bahwa hasilnya dapat diandalkan.


#### <a id='toc7_6_1_2_'></a>[Object & Categorical](#toc0_)

**Karakteristik tipe data `object`**:
- Mirip seperti tipe data string pada python
- Kemunculannya unik (artinya setiap row kemunculannya hanya 1 atau beberapa)

**Karakteristik tipe data `category`:**
- Dapat dikelompokkan menjadi beberapa kelompok (category)
- Kemunculannya berulang

Dua alasan mengapa kita perlu menggunakan tipe data categorical:

1. **Business Perspective Side**: dapat memandu seorang Analyst untuk memilih metode statistik atau tipe plot mana yang digunakan untuk mengolah data.

2. **Technical Side**: tipe data categorical akan menghemat memori dan menambah kecepatan komputasional

### <a id='toc7_6_2_'></a>[Mengubah Tipe Data](#toc0_)

Untuk mengubah tipe data ke categorical pada pandas, Anda dapat melakukannya dengan method `astype()` berikut:

**Formula** 
```
df['column_name'] = df['column_name'].astype('new_data_types')
```

**Contoh**
```
employees['marital_status'] = employees['marital_status'].astype('category')
```

Perhatikan dataframe baru di bawah ini untuk contoh lain dari tipe data pada `pandas`!

In [48]:
employees = pd.DataFrame({
    'name': ['Anita', 'Brian'],
    'age': ['34', '29'],
    'joined': [pd.Timestamp('20190410'), pd.Timestamp('20171128')],
    'degree': [True, False],
    'hourlyrate': [35.5, 29],
    'division': ['HR', 'Product']
})

employees

    name age     joined  degree  hourlyrate division
0  Anita  34 2019-04-10    True          36       HR
1  Brian  29 2017-11-28   False          29  Product

In [49]:
employees.dtypes

name                  object
age                   object
joined        datetime64[ns]
degree                  bool
hourlyrate           float64
division              object
dtype: object

- `name` [`object`]: store text values
- `age` [`object`]: store text values
- `joined` [`datetime`]: date and time values
- `degree` [`bool`]: True/False values
- `hourlyrate` [`float`]: floating point values
- `division` [`object`]: store text values

‚ùìPerhatikan dataframe `employees`. Adakah kolom yang tipe datanya belum tersimpan dengan benar? Ubahlah ke tipe data yang tepat dengan menggunakan method `astype()`!

Kolom yang perlu diubah tipe datanya:
- Age : object -> int
- Division : object -> category

In [50]:
employees['age'] = employees['age'].astype('int64')

In [51]:
employees['division'] = employees['division'].astype('category')

In [52]:
employees.dtypes

name                  object
age                    int64
joined        datetime64[ns]
degree                  bool
hourlyrate           float64
division            category
dtype: object

In [53]:
employees['kolom_baru'] = 3
employees

    name  age     joined  degree  hourlyrate division  kolom_baru
0  Anita   34 2019-04-10    True          36       HR           3
1  Brian   29 2017-11-28   False          29  Product           3

___

### <a id='toc7_6_3_'></a>[Rangkuman Data Types](#toc0_)

Fokus pada kolom Pandas dtype dan usage-nya:

| Pandas dtype  | Python type  | NumPy type                                                     | Usage                                        |
|---------------|--------------|----------------------------------------------------------------|----------------------------------------------|
| object        | str or mixed | string_, unicode_, mixed types                                 | Text or mixed numeric and non-numeric values |
| int64         | int          | int_, int8, int16, int32, int64, uint8, uint16, uint32, uint64 | Integer numbers                              |
| float64       | float        | float_, float16, float32, float64                              | Floating point numbers                       |
| bool          | bool         | bool_                                                          | True/False values                            |
| datetime64    | NA           | datetime64[ns]                                                 | Date and time values                         |
| timedelta[ns] | NA           | NA                                                             | Differences between two datetimes            |
| category      | NA           | NA                                                             | Finite list of text values                   |

Referensi: [Overview of Pandas Data Types](https://pbpython.com/pandas_dtypes.html)

___

**Data Rice**

Atribut `dtypes` digunakan untuk melakukan inspeksi tipe data.

---

üí° Kita bisa menggunakan method berikut untuk **mengidentifikasi kolom mana yang cocok untuk disimpan ke tipe data `category`**

- `.unique()` untuk melihat nilai unik di setiap Series
- `.nunique()` untuk melihat jumlah nilai unik/distict pada Series/Dataframe

---

In [54]:
rice.dtypes

receipt_id            int64
receipts_item_id      int64
purchase_time        object
category             object
sub_category         object
format               object
unit_price          float64
discount              int64
quantity              int64
yearmonth            object
dtype: object

In [55]:
rice.nunique()

receipt_id          11915
receipts_item_id    12000
purchase_time       11609
category                1
sub_category            1
format                  3
unit_price           1449
discount              274
quantity               15
yearmonth              12
dtype: int64

In [56]:
rice.head(2)

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07

> Kolom category: category,Ôæ†sub_category,Ôæ†format, yearmonth

In [57]:
['jakarta', 'bogor']

['jakarta', 'bogor']

Untuk melakukan seleksi lebih dari 1 kolom, kita membutuhkan `[]` untuk membungkus list dari kolom tersebut

In [58]:
# ubah tipe data data data rice
rice[['category', 'sub_category', 'format', 'yearmonth']] = \
rice[['category', 'sub_category', 'format', 'yearmonth']].astype('category')

rice.dtypes

receipt_id             int64
receipts_item_id       int64
purchase_time         object
category            category
sub_category        category
format              category
unit_price           float64
discount               int64
quantity               int64
yearmonth           category
dtype: object

## <a id='toc7_7_'></a>[Knowledge Check: Data types](#toc0_)

Misalkan saja kita memiliki sebuah DataFrame dengan nama `inventory`.

Ketika menjalankan perintah `inventory.dtypes`, maka pandas akan menampilkan tipe data pada setiap kolom (series). Manakah kolom dibawah ini yang mungkin memiliki tipe data yang salah?
 - [x] `product_id`: int64 --> object
 - [ ] `units_instock`: int64
 - [ ] `discount_price`: float64
 - [ ] `item_name`: object
 - [x] `category`: object -> category
 - [x] `units_sold`: object -> int64
 - [x] `year_sold`: object -> 
   - category -> ketika tidak ingin melakukan analisa perhitungan dengan kolom ini
   - int64 -> ingin melakukan analisa perhitungan 
   - datetime -> tidak tepat, karena informasinya kurang lengkap. datetime -> minimal mengandung tanggal, bulan, tahun

In [59]:
inventory = pd.DataFrame({
    'product_id': [145789, 9157889, 8147889, 7148889, 1578895],
    'units_instock': [100, 150, 80, 200, 120],
    'discount_price': [29.99, 49.99, 39.99, 19.99, 59.99],
    'item_name': ['Product A', 'Product B', 'Product C', 'Product D', 'Product E'],
    'category': ['Electronics', 'Clothing', 'Home & Kitchen', 'Electronics', 'Beauty'],
    'units_sold': ['50', '75', '30', '90', '60'],
    'year_sold': [2022, 2022, 2021, 2023, 2022]
})
inventory.dtypes

product_id          int64
units_instock       int64
discount_price    float64
item_name          object
category           object
units_sold         object
year_sold           int64
dtype: object

___

In [60]:
rice['category']

1        Rice
2        Rice
3        Rice
4        Rice
5        Rice
         ...
11996    Rice
11997    Rice
11998    Rice
11999    Rice
12000    Rice
Name: category, Length: 12000, dtype: category
Categories (1, object): ['Rice']

# <a id='toc8_'></a>[Indexing and Subsetting with Pandas](#toc0_)

Indexing digunakan untuk memilih dan mengambil sebagian data yang hanya diperlukan dalam proses analisa data yang sedang dikerjakan. Contohnya:
- Compare sales pada tahun 2018 vs 2019
- Identifikasi peluang penjualan pada segment pasar (ex : Wholesale vs Retail)
- Melihat quarter terbaik untuk setiap tahun yang dapat digunakan untuk tujuan promosi
- dan sebagainya

Untuk melakukan indexing dan subsetting (slicing data) pada `pandas`, kita dapat menggunakan cara sebagai berikut:
- `head()` and `tail()`  
- `select_dtypes()`  
- Using `.drop()` 
- The `[]` operator
- `.loc`  
- `.iloc`
- Conditional subsetting

## <a id='toc8_1_'></a>[`select_dtypes()`](#toc0_)

Method `select_dtypes()` digunakan untuk memilih **kolom** sesuai dengan tipe datanya. Ada 2 parameter yang dapat digunakan di dalam method `select_dtypes()` yaitu parameter `include` dan `exclude` (seperti pada `describe()`.

Misal:
- parameter `include = 'category'` artinya kita memilih semua kolom dengan tipe data 'category'
- sebaliknya, ketika menggunakan parameter `exclude = 'category'` maka kolom-kolom dengan tipe data selain 'category' akan ditampilkan.

In [61]:
# code here --> only category
rice.select_dtypes(include='category')

      category sub_category       format yearmonth
1         Rice         Rice  supermarket   2018-07
2         Rice         Rice   minimarket   2018-07
3         Rice         Rice  supermarket   2018-07
4         Rice         Rice   minimarket   2018-07
5         Rice         Rice  supermarket   2018-07
...        ...          ...          ...       ...
11996     Rice         Rice  supermarket   2017-12
11997     Rice         Rice   minimarket   2017-12
11998     Rice         Rice  supermarket   2017-12
11999     Rice         Rice   minimarket   2017-12
12000     Rice         Rice   minimarket   2017-12

[12000 rows x 4 columns]

‚ùì Bagaimana cara Anda untuk menyeleksi kolom dengan tipe data `int64` dan `float64` untuk ditampilkan?

In [62]:
# code here
rice.select_dtypes(include=['int64', 'float64'])

       receipt_id  receipts_item_id  unit_price  discount  quantity
1         9622257          32369294     128,000         0         1
2         9446359          31885876     102,750         0         1
3         9470290          31930241      64,000         0         3
4         9643416          32418582      65,000         0         1
5         9692093          32561236     124,500         0         1
...           ...               ...         ...       ...       ...
11996     5760491          17555486     128,000         0         1
11997     5598782          16999147      64,000         0         1
11998     5735850          17434503      59,990      3000         1
11999     5678748          17317935      59,500      3000         1
12000     5702411          17341559      59,500      3000         1

[12000 rows x 5 columns]

In [63]:
rice.select_dtypes(include='number')

       receipt_id  receipts_item_id  unit_price  discount  quantity
1         9622257          32369294     128,000         0         1
2         9446359          31885876     102,750         0         1
3         9470290          31930241      64,000         0         3
4         9643416          32418582      65,000         0         1
5         9692093          32561236     124,500         0         1
...           ...               ...         ...       ...       ...
11996     5760491          17555486     128,000         0         1
11997     5598782          16999147      64,000         0         1
11998     5735850          17434503      59,990      3000         1
11999     5678748          17317935      59,500      3000         1
12000     5702411          17341559      59,500      3000         1

[12000 rows x 5 columns]

In [64]:
rice.select_dtypes(exclude=['category','object'])

       receipt_id  receipts_item_id  unit_price  discount  quantity
1         9622257          32369294     128,000         0         1
2         9446359          31885876     102,750         0         1
3         9470290          31930241      64,000         0         3
4         9643416          32418582      65,000         0         1
5         9692093          32561236     124,500         0         1
...           ...               ...         ...       ...       ...
11996     5760491          17555486     128,000         0         1
11997     5598782          16999147      64,000         0         1
11998     5735850          17434503      59,990      3000         1
11999     5678748          17317935      59,500      3000         1
12000     5702411          17341559      59,500      3000         1

[12000 rows x 5 columns]

## <a id='toc8_2_'></a>[`drop()`](#toc0_)

Method `drop()` digunakan untuk membuang baris atau kolom yang tidak ingin digunakan untuk tujuan analisis. Secara default method ini akan menghapus baris

### <a id='toc8_2_1_'></a>[Hapus berdasarkan index baris](#toc0_)

**Hapus index baris 1 pada DataFrame**

In [65]:
rice.drop(index=1)

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",0,3,2018-07
4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,"65,000",0,1,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",0,1,2018-07
6,9504155,32030785,7/17/2018 18:05,Rice,Rice,minimarket,"63,500",0,1,2018-07
...,...,...,...,...,...,...,...,...,...,...
11996,5760491,17555486,12/15/2017 21:06,Rice,Rice,supermarket,"128,000",0,1,2017-12
11997,5598782,16999147,12/2/2017 14:12,Rice,Rice,minimarket,"64,000",0,1,2017-12
11998,5735850,17434503,12/13/2017 19:17,Rice,Rice,supermarket,"59,990",3000,1,2017-12
11999,5678748,17317935,12/8/2017 22:04,Rice,Rice,minimarket,"59,500",3000,1,2017-12
12000,5702411,17341559,12/10/2017 17:04,Rice,Rice,minimarket,"59,500",3000,1,2017-12

‚ùì Hapus index baris 2 dan 4 pada data

In [66]:
# code here
rice.drop(index=[2,4])

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",0,3,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",0,1,2018-07
6,9504155,32030785,7/17/2018 18:05,Rice,Rice,minimarket,"63,500",0,1,2018-07
7,9822589,32935097,7/29/2018 18:18,Rice,Rice,supermarket,"66,500",0,1,2018-07
...,...,...,...,...,...,...,...,...,...,...
11996,5760491,17555486,12/15/2017 21:06,Rice,Rice,supermarket,"128,000",0,1,2017-12
11997,5598782,16999147,12/2/2017 14:12,Rice,Rice,minimarket,"64,000",0,1,2017-12
11998,5735850,17434503,12/13/2017 19:17,Rice,Rice,supermarket,"59,990",3000,1,2017-12
11999,5678748,17317935,12/8/2017 22:04,Rice,Rice,minimarket,"59,500",3000,1,2017-12
12000,5702411,17341559,12/10/2017 17:04,Rice,Rice,minimarket,"59,500",3000,1,2017-12

### <a id='toc8_2_2_'></a>[Hapus berdasarkan index kolom](#toc0_)

**Hapus index kolom `receipts_item_id`**

In [67]:
# drop columns receipts_item_id
rice.drop(columns='receipts_item_id')

,receipt_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
2,9446359,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07
3,9470290,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",0,3,2018-07
4,9643416,7/24/2018 8:27,Rice,Rice,minimarket,"65,000",0,1,2018-07
5,9692093,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",0,1,2018-07
...,...,...,...,...,...,...,...,...,...
11996,5760491,12/15/2017 21:06,Rice,Rice,supermarket,"128,000",0,1,2017-12
11997,5598782,12/2/2017 14:12,Rice,Rice,minimarket,"64,000",0,1,2017-12
11998,5735850,12/13/2017 19:17,Rice,Rice,supermarket,"59,990",3000,1,2017-12
11999,5678748,12/8/2017 22:04,Rice,Rice,minimarket,"59,500",3000,1,2017-12
12000,5702411,12/10/2017 17:04,Rice,Rice,minimarket,"59,500",3000,1,2017-12

‚ùì Hapus kolom `unit_price`, `purchase_time`, `receipts_item_id`

In [68]:
# code here
rice.drop(columns= ['unit_price', 'purchase_time', 'receipts_item_id'])

,receipt_id,category,sub_category,format,discount,quantity,yearmonth
1,9622257,Rice,Rice,supermarket,0,1,2018-07
2,9446359,Rice,Rice,minimarket,0,1,2018-07
3,9470290,Rice,Rice,supermarket,0,3,2018-07
4,9643416,Rice,Rice,minimarket,0,1,2018-07
5,9692093,Rice,Rice,supermarket,0,1,2018-07
...,...,...,...,...,...,...,...
11996,5760491,Rice,Rice,supermarket,0,1,2017-12
11997,5598782,Rice,Rice,minimarket,0,1,2017-12
11998,5735850,Rice,Rice,supermarket,3000,1,2017-12
11999,5678748,Rice,Rice,minimarket,3000,1,2017-12
12000,5702411,Rice,Rice,minimarket,3000,1,2017-12

___

üìå **NOTE:** Method `drop()` tidak mengubah objek dataframenya. Apabila ingin mengubah objek semulanya:
- Melakukan assignment kembali dengan nama objek yang sama: `rice = rice.drop(...)`, atau
- Menambahkan parameter inplace: `rice.drop(..., inplace=True)`

___

## <a id='toc8_3_'></a>[Slicing: **`[]` operator**](#toc0_)

Digunakan untuk melakukan subsetting dengan cara mengiris (slicing) index pada dataframe. Formula penulisannya adalah `[start:end]` dengan mengikuti aturan indexing pada python (dimulai dari 0) dimana `start` inclusive dan `end` exclusive.

Dengan menggunakan metode slicing, silahkan tampilkan baris ke 1 dan ke 2

In [69]:
# slice baris ke 1 dan 2
rice[0:2]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07

rice[0:2] = ambil data rice baris 1 (di python baris 1 = 0 hingga baris 2)

‚ùì Dengan menggunakan metode slicing, silahkan tampilkan baris ke 10 sampai ke 15

In [70]:
# code here
rice[9:15]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
10,9444092,31913062,7/14/2018 21:17,Rice,Rice,supermarket,"64,000",0,3,2018-07
11,9198777,31125365,7/2/2018 15:39,Rice,Rice,minimarket,"112,500",0,1,2018-07
12,9763483,32856560,7/31/2018 5:51,Rice,Rice,hypermarket,"77,750",0,1,2018-07
13,9691090,32552145,7/26/2018 11:43,Rice,Rice,minimarket,"66,500",0,1,2018-07
14,9624752,32369065,7/23/2018 14:22,Rice,Rice,minimarket,"62,900",0,1,2018-07
15,9543709,32142234,7/19/2018 18:05,Rice,Rice,minimarket,"64,000",0,1,2018-07

___

## <a id='toc8_4_'></a>[`.iloc` dan `.loc`](#toc0_)

Dengan menggunakan `.iloc` dan `loc` kita dapat melakukan pengirisan pada index **baris dan kolom**. 

Perbedaan yang mendasar dari kedua operator ini adalah:
- `.iloc` merujuk pada lokasi **index** baris atau kolomnya sehingga harus **integer**, sedangkan
- `.loc` merujuk pada lokasi **nama** baris atau kolomnya

**Mari berfokus pada .iloc terlebih dahulu**

> Syntax: `df.iloc[baris, kolom]`

In [71]:
# menggunakan method .head() 
rice.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",0,3,2018-07
4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,"65,000",0,1,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",0,1,2018-07

In [72]:
# menggunakan slicing
rice[0:5]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",0,3,2018-07
4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,"65,000",0,1,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",0,1,2018-07

In [73]:
# menggunakan perintah .iloc
rice.iloc[0:5 , :]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",0,3,2018-07
4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,"65,000",0,1,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",0,1,2018-07

Menampilkan baris pertama (index baris 1) dan kolom ke-6 (index kolom ke 6), artinya adalah data pada baris kedua dan kolom `unit_price`.

In [74]:
# baris 0, kolom 6
rice.iloc[ [0] , [6] ]

   unit_price
1     128,000

In [75]:
rice.iloc[ 0 , 6 ]

np.float64(128000.0)

Pada konteks slicing:

- `,` -> dan
- `:` -> sampai

üìå **Note :** parameter colon (:) digunakan untuk menampilkan semua data baik pada baris ataupun kolom

In [76]:
rice.iloc[ : , : ]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",0,3,2018-07
4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,"65,000",0,1,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",0,1,2018-07
...,...,...,...,...,...,...,...,...,...,...
11996,5760491,17555486,12/15/2017 21:06,Rice,Rice,supermarket,"128,000",0,1,2017-12
11997,5598782,16999147,12/2/2017 14:12,Rice,Rice,minimarket,"64,000",0,1,2017-12
11998,5735850,17434503,12/13/2017 19:17,Rice,Rice,supermarket,"59,990",3000,1,2017-12
11999,5678748,17317935,12/8/2017 22:04,Rice,Rice,minimarket,"59,500",3000,1,2017-12
12000,5702411,17341559,12/10/2017 17:04,Rice,Rice,minimarket,"59,500",3000,1,2017-12

‚ùìMengambil baris ke-2 sampai 5 dan kolom dengan `receipts_item_id` sampai `purchase_time`

In [77]:
# code here
rice.iloc[1:5, 1:3]

   receipts_item_id    purchase_time
2          31885876  7/15/2018 16:17
3          31930241  7/15/2018 12:12
4          32418582   7/24/2018 8:27
5          32561236  7/26/2018 11:28

___

*Mari kita pergi ke .loc**

> Syntax: `df.loc[baris, kolom]`

Menggunakan `.loc`, kita bisa mengambil baris dan kolom berdasarkan namanya. Contoh kita ingin mengambil baris dengan index baris 1 dan 3, serta mengambil semua kolom.

In [78]:
# code here
rice.loc[[1,3] , : ]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",0,3,2018-07

‚ùì Mengambil baris pada index transaksi 100, 200, 300, 400, 500 dari kolom `category` sampai `quantity`

In [79]:
rice.loc[[100,200,300,400,500], 'category':'quantity' ]

    category sub_category       format  unit_price  discount  quantity
100     Rice         Rice   minimarket      63,500         0         1
200     Rice         Rice   minimarket      62,900         0         1
300     Rice         Rice  supermarket     117,900     10100         1
400     Rice         Rice  supermarket      64,000         0         1
500     Rice         Rice   minimarket      64,000         0         1

[‚ú® QUICK SUMMARY: INDEXING AND SUBSETTING ‚ú®]

Indexing dan Subsetting: Pengambilan sebagian data yang dibutuhkan.

‚Ä¢ `.select_dtypes()`: Pilih kolom dengan tipe data tertentu.
    + Parameter `include=` untuk tipe data yang diinginkan.
    + Parameter `exclude=` untuk tipe data yang tidak diinginkan.
‚Ä¢ `.drop()`: Hapus baris atau kolom yang dipilih.
    + Parameter `index=` untuk memilih index baris yang ingin dihapus.
    + Parameter `columns=` untuk memilih index kolom yang ingin dihapus.
‚Ä¢ Slicing menggunakan operator `[]`: Pilih baris dengan format `[start:end]`.
‚Ä¢ `.iloc[]`: Pilih data berdasarkan angka urutan baris dan kolom dengan format `[baris, kolom]`.
‚Ä¢ `.loc[]`: Pilih data berdasarkan nama baris dan kolom dengan format `[baris, kolom]`.

Pada konteks subsetting, syntax:
- `[]` -> untuk slicing dan juga untuk membungkus lebih dari 1 nilai
- `[]` -> bisa sebagai pembungkus supaya outputnya menjadi object dataframe
- `,` -> artinya dan
- `:` -> artinya sampai

___

#### <a id='toc8_4_1_1_'></a>[üèÑüèª‚Äç‚ôÄÔ∏è Dive Deeper:](#toc0_)
Baca data `companies.csv`dan gunakan `index_col=1`, kemudian tampilkan beberapa baris menggunakan method `head()` atau `tail()`

Dengan menggunakan metode indexing, jawab pertanyaan dibawah ini!

1. Tampilkan lokasi kantor *Li and Partners*?
2. Tampilkan nilai `Returns` yang dihasilkan oleh PT. Algoritma Data Indonesia?
3. Tampilkan nilai `Forecasted Growth` untuk Palembang Konsultansi?

In [80]:
# code here
companies = pd.read_csv('data_input/companies.csv', index_col=1)
companies

,ID,Consulting Sales,Software Sales,Forecasted Growth,Returns,Month,Day,Year,Location,Account
Customer Name,,,,,,,,,,
New Media Group,30940,IDR7125000,IDR5500000,30.00%,"IDR1,500,000",1,10,2017,Jakarta,Enterprise
Li and Partners,82391,IDR420000,IDR820000,10.00%,"IDR400,000",6,15,2016,Jakarta,Startup
PT. Kreasi Metrik Solusi,18374,0,IDR550403,25.00%,0,3,29,2012,Surabaya,Enterprise
PT. Algoritma Data Indonesia,57531,IDR850000,IDR395500,4.00%,0,7,17,2017,Jakarta,Startup
Palembang Konsultansi,19002,IDR2115000,0,-15.00%,0,2,24,2018,Bandung,Startup
PT. Surya Citra Manajemen,31142,IDR960000,IDR503000,19.00%,0,1,19,2019,Jakarta,Enterprise

In [81]:
# 1.
print('Li and Partners berada di Kota', companies.loc['Li and Partners','Location'] )

Li and Partners berada di Kota Jakarta

In [82]:
# 2. 
print(companies.loc[['PT. Algoritma Data Indonesia'], ['Returns']])

                             Returns
Customer Name
PT. Algoritma Data Indonesia       0

In [83]:
# 3. 
print("Forecasted Growth Palembang Konsultansi :",
      companies.loc['Palembang Konsultansi','Forecasted Growth'])

Forecasted Growth Palembang Konsultansi : -15.00%

___

In [84]:
rice['quantity'].mean()

np.float64(1.3329166666666667)

In [85]:
rice['format'].unique()

['supermarket', 'minimarket', 'hypermarket']
Categories (3, object): ['hypermarket', 'minimarket', 'supermarket']

## <a id='toc8_5_'></a>[Conditional Subsetting](#toc0_)

Selain menggunakan `.loc` dan `.iloc`, kita dapat melakukan subsetting berdasarkan kondisi tertentu. Misal pada dataframe `rice`, kita ingin mengambil beberapa data dengan kondisi sebagai berikut:

- Transaksi yang terjadi di supermarket: `.format == 'supermarket'`
- Transaksi dengan produk yang harganya lebih dari sama dengan 200000: `.unit_price >= 200000`
- Transaksi dimana kuantitas tidak sama dengan 0: `.quantity != 0`

Syntax penulisan untuk conditional subsetting adalah:

**`df[df['column_name'] <comparison_operator> <value>]`**

atau

**`df[df.column_name <comparison_operator> <value>]`**

Contoh comparison_operator adalah seperti `==`, `!=`, `>`, `>=`, `<`, `<=`.

üîª Menampilkan data yang memiliki `format` Supermarket!

In [86]:
# format supermarket
kondisi = rice['format'] == 'supermarket'

In [87]:
rice[ kondisi ]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",0,3,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",0,1,2018-07
7,9822589,32935097,7/29/2018 18:18,Rice,Rice,supermarket,"66,500",0,1,2018-07
10,9444092,31913062,7/14/2018 21:17,Rice,Rice,supermarket,"64,000",0,3,2018-07
...,...,...,...,...,...,...,...,...,...,...
11988,5820673,17694778,12/20/2017 20:17,Rice,Rice,supermarket,"64,000",0,2,2017-12
11993,5695117,17313052,12/10/2017 10:59,Rice,Rice,supermarket,"104,500",13600,2,2017-12
11994,5889920,17910836,12/25/2017 14:24,Rice,Rice,supermarket,"116,300",0,1,2017-12
11996,5760491,17555486,12/15/2017 21:06,Rice,Rice,supermarket,"128,000",0,1,2017-12
11998,5735850,17434503,12/13/2017 19:17,Rice,Rice,supermarket,"59,990",3000,1,2017-12

In [88]:
rice[rice['format'] == 'supermarket']

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",0,3,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",0,1,2018-07
7,9822589,32935097,7/29/2018 18:18,Rice,Rice,supermarket,"66,500",0,1,2018-07
10,9444092,31913062,7/14/2018 21:17,Rice,Rice,supermarket,"64,000",0,3,2018-07
...,...,...,...,...,...,...,...,...,...,...
11988,5820673,17694778,12/20/2017 20:17,Rice,Rice,supermarket,"64,000",0,2,2017-12
11993,5695117,17313052,12/10/2017 10:59,Rice,Rice,supermarket,"104,500",13600,2,2017-12
11994,5889920,17910836,12/25/2017 14:24,Rice,Rice,supermarket,"116,300",0,1,2017-12
11996,5760491,17555486,12/15/2017 21:06,Rice,Rice,supermarket,"128,000",0,1,2017-12
11998,5735850,17434503,12/13/2017 19:17,Rice,Rice,supermarket,"59,990",3000,1,2017-12

üîª Menampilkan data yang memiliki `unit_price` lebih besar sama dengan 200.000

In [89]:
rice

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",0,3,2018-07
4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,"65,000",0,1,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",0,1,2018-07
...,...,...,...,...,...,...,...,...,...,...
11996,5760491,17555486,12/15/2017 21:06,Rice,Rice,supermarket,"128,000",0,1,2017-12
11997,5598782,16999147,12/2/2017 14:12,Rice,Rice,minimarket,"64,000",0,1,2017-12
11998,5735850,17434503,12/13/2017 19:17,Rice,Rice,supermarket,"59,990",3000,1,2017-12
11999,5678748,17317935,12/8/2017 22:04,Rice,Rice,minimarket,"59,500",3000,1,2017-12
12000,5702411,17341559,12/10/2017 17:04,Rice,Rice,minimarket,"59,500",3000,1,2017-12

In [90]:
rice[rice['unit_price'] >= 200000 ].shape[0]

67

‚ùìTampilkan transaksi yang harganya (`unit_price`) kurang dari 100.000

In [91]:
rice.shape

(12000, 10)

In [92]:
# code here
rice[rice['unit_price'] < 100000].shape[0]

10062

In [93]:
rice[rice['unit_price'] < 100000].describe()

       receipt_id  receipts_item_id  unit_price  discount  quantity
count      10,062            10,062      10,062    10,062    10,062
mean    7,689,903        24,726,234      58,917       775         1
std     1,878,877         7,192,376      14,728     5,807         1
min     3,173,994         9,282,023       9,395    -4,100         1
25%     6,017,408        18,300,462      60,000         0         1
50%     7,499,880        22,491,122      62,900         0         1
75%     9,217,678        31,261,312      64,000         0         1
max    11,463,208        38,255,958      99,995   320,000        19

In [94]:
rice['unit_price'].min()

np.float64(9395.0)

In [95]:
rice['unit_price'].max()

np.float64(219400.0)

‚ùì Tampilkan transaksi selain di Supermarket (kolom `format`)!

In [96]:
# code here
rice[rice['format'] != 'supermarket'].shape[0]

8087

In [97]:
ex_supermarket = rice[rice['format'] != 'supermarket']

In [98]:
ex_supermarket['format'].unique()

['minimarket', 'hypermarket']
Categories (3, object): ['hypermarket', 'minimarket', 'supermarket']

**Additional Notes**

Setelah mendapatkan data hasil subsetting, kita bisa melakukan pengecheckan untuk memastikan apakah data yang di subset sudah tepat, dengan cara:
- Untuk data numerik -> menggunakan `describe()`
- Untuk data non-numerik -> menggunakan `unique()`, atau bisa juga menggunakan `describe()`

## <a id='toc8_6_'></a>[Multiple Conditions](#toc0_)

Kita juga dapat menggunakan operator `&` (AND) dan `|` (OR) untuk melakukan subsetting lebih dari 1 kondisi. Misalnya kita ingin melihat data penjualan dari seorang pegawai bernama Moana yang jumlahnya lebih dari 5000, maka kita dapat menggunakan syntax:
```
sales[(sales.salesperson == 'Moana') & (sales.amount > 5000)]
```

Untuk subsetting dengan kondisi lebih dari 1, setiap kondisi diletakkan **di dalam tanda kurung `()`** atau bisa ditulis dengan syntax berikut:

```
df[(kondisi pertama) operator (kondisi kedua) operator (kondisi ketiga) dan seterusnya...]
```

**Poin:**
- Operator AND: harus semua kondisi terpenuhi dalam satu baris agar muncul
- Operator OR: salah satu kondisi saja sudah terpenuhi maka baris tsb muncul
___
- cond1 = kondisi 1
- cond2 = kondisi 2
```
rice[(cond1)&(cond2)]
rice[(cond1)|(cond2)]
```

**Contoh sederhana penggunaan OR dan AND**

In [99]:
df = pd.DataFrame({
    'angka': [1,2,3],
    'huruf': ['a','b','c']
})
df

   angka huruf
0      1     a
1      2     b
2      3     c

**OPERATOR AND**

Menampilkan baris dengan `angka` 1 dan `huruf` a

In [100]:
#code here
df[(df['angka'] == 1) & (df['huruf']=='a')]

   angka huruf
0      1     a

Menampilkan baris dengan `angka` 1 dan `huruf` b

In [101]:
#code here
df[(df['angka'] == 1) & (df['huruf']=='b')]

Empty DataFrame
Columns: [angka, huruf]
Index: []

**OPERATOR OR**

Menampilkan baris dengan `angka` 1 atau `huruf` b

In [102]:
df

   angka huruf
0      1     a
1      2     b
2      3     c

In [103]:
#code here
df[(df['angka'] == 1) | (df['huruf']=='b')]

   angka huruf
0      1     a
1      2     b

___

‚ùì Lakukan subsetting untuk mengambil semua transaksi di `supermarket` yang `unit_price`nya di atas 200,000.?

In [104]:
# code here
kond1 = rice['format'] == 'supermarket'
kond2 = rice['unit_price'] > 200000

rice[ (kond1) & (kond2) ].shape[0]

13

‚ùì Subset baris yang formatnya `supermarket` dan `minimarket`

In [105]:
# code here
rice[ (rice['format']=='supermarket')  |  (rice['format']=='minimarket')  ].shape[0]

11001

Subset baris, yang harga berasnya diantara 50.000 sampai 100.000

In [106]:
rice[(rice['unit_price'] >= 50000) & (rice['unit_price'] <= 100000)].describe()

       receipt_id  receipts_item_id  unit_price  discount  quantity
count       8,786             8,786       8,786     8,786     8,786
mean    7,665,336        24,634,950      63,857       682         1
std     1,846,871         7,089,614       6,097     4,241         1
min     3,173,994         9,282,023      50,000    -4,100         1
25%     6,032,539        18,340,666      62,500         0         1
50%     7,489,819        22,445,304      63,500         0         1
75%     9,127,687        31,030,240      64,000         0         1
max    11,463,208        38,209,441     100,000   266,000        19

In [107]:
rice[rice['unit_price'].between(50000, 100000)].shape[0]

8786

___

## <a id='toc8_7_'></a>[üèÑüèª‚Äç‚ôÄÔ∏è Dive Deeper](#toc0_)

Dengan menggunakan metode conditional subsetting, jawab pertanyaan dibawah ini:

1. Apabila Anda masih ingat, pada `.describe()` kita menemui bahwa terdapat transaksi janggal dengan **`discount` yang bernilai negatif**. Ada berapa transaksi yang janggal tersebut?
2. Perusahaan mendefinisikan pembelian grosir sebagai transaksi dengan `quantity` **minimal 12 units (1 Lusin)**. Berapa transaksi pada **hypermarket** yang dikatakan sebagai pembelian grosir?

*Hint: Gunakan `.shape` untuk mengetahui jumlah baris/kolom*

In [108]:
# your code here: no 1
rice[rice['discount'] < 0]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1863,10127394,33894692,8/13/2018 13:42,Rice,Rice,minimarket,"68,100",-4100,1,2018-08

In [109]:
# your code here: no 2
rice[
    (rice['quantity'] >= 12) &
    (rice['format'] == 'hypermarket')
].shape[0]

5

**Bonus Challenge**

Berapa banyak transaksi pada dataframe `rice` yang terjadi pada bulan Juli tahun 2018 baik di `minimarket` maupun `supermarket`?

In [110]:
# code here
rice[
    (rice['yearmonth'] == '2018-07') &
    (
        (rice['format']=='minimarket') |
        (rice['format']=='supermarket')
    )
].shape[0]

935

___

In [111]:
rice_edit = rice

# <a id='toc9_'></a>[Referencing and Copying](#toc0_)

Pada python, tanda sama dengan (`=`) bisa digunakan untuk me-**refer** sebuah Dataframe. Sekarang mari kita lihat kembali dataframe `rice`:

In [112]:
import pandas as pd
rice = pd.read_csv("data_input/rice.csv", index_col=1)
rice = rice.drop('Unnamed: 0', axis=1)
rice.head()

,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
receipt_id,,,,,,,,,
9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07
9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",0,3,2018-07
9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,"65,000",0,1,2018-07
9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",0,1,2018-07

## <a id='toc9_1_'></a>[Reference](#toc0_)

Membuat dataframe baru dengan nama `rice_second` yang menyimpan semua transaksi seperti `rice`. Kemudian misalnya kita ingin update kolom `discount` agar menjadi 15 pada semua barisnya.

In [113]:
#code here
rice2 = rice

In [114]:
rice2['discount'] = 15
rice2.head()

,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
receipt_id,,,,,,,,,
9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",15,1,2018-07
9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",15,1,2018-07
9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",15,3,2018-07
9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,"65,000",15,1,2018-07
9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",15,1,2018-07

In [115]:
rice.head()

,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
receipt_id,,,,,,,,,
9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",15,1,2018-07
9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",15,1,2018-07
9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",15,3,2018-07
9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,"65,000",15,1,2018-07
9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",15,1,2018-07

## <a id='toc9_2_'></a>[Copying](#toc0_)

Membuat dataframe baru dengan nama `rice_second` yang menyimpan semua transaksi seperti `rice`. Kemudian misalnya kita ingin update kolom `discount` agar menjadi 15 pada semua barisnya.

In [116]:
#code here
rice = pd.read_csv("data_input/rice.csv", index_col=1)
rice.head()

,Unnamed: 0,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
receipt_id,,,,,,,,,,
9622257,1,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
9446359,2,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07
9470290,3,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",0,3,2018-07
9643416,4,32418582,7/24/2018 8:27,Rice,Rice,minimarket,"65,000",0,1,2018-07
9692093,5,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",0,1,2018-07

In [117]:
#code here
rice3 = rice.copy()
rice3.head()

,Unnamed: 0,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
receipt_id,,,,,,,,,,
9622257,1,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
9446359,2,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07
9470290,3,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",0,3,2018-07
9643416,4,32418582,7/24/2018 8:27,Rice,Rice,minimarket,"65,000",0,1,2018-07
9692093,5,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",0,1,2018-07

In [118]:
rice3['discount'] = 20
rice3.head()

,Unnamed: 0,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
receipt_id,,,,,,,,,,
9622257,1,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",20,1,2018-07
9446359,2,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",20,1,2018-07
9470290,3,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",20,3,2018-07
9643416,4,32418582,7/24/2018 8:27,Rice,Rice,minimarket,"65,000",20,1,2018-07
9692093,5,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",20,1,2018-07

In [119]:
rice.head()

,Unnamed: 0,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
receipt_id,,,,,,,,,,
9622257,1,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07
9446359,2,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07
9470290,3,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",0,3,2018-07
9643416,4,32418582,7/24/2018 8:27,Rice,Rice,minimarket,"65,000",0,1,2018-07
9692093,5,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",0,1,2018-07

In [120]:
# check id rice

In [121]:
# check id rice_second

___

# <a id='toc10_'></a>[Additional Information](#toc0_)

- [Book - Python for Data Analysis](https://www.programmer-books.com/wp-content/uploads/2019/04/Python-for-Data-Analysis-2nd-Edition.pdf)
- [Self Exercise - LearnPy Algoritma for P4DA Course](https://gitlab.com/algoritma4students/academy-python/exercise/learnpy-da)

### <a id='toc10_1_1_'></a>[Cara Membuat Kolom Baru](#toc0_)

Cara membuat kolom baru
    ```
    df['new_column'] = new_value
    ```

`new_column` merupakan nama kolom yang sebelumnya tidak ada di dataframe `df`.

Kasus: Ingin menghitung `total_price` yaitu hasil perkalian `unit_price` dengan `quantity`

In [122]:
rice['total_price'] = rice['unit_price'] * rice['quantity']

In [123]:
rice.head()

,Unnamed: 0,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth,total_price
receipt_id,,,,,,,,,,,
9622257,1,32369294,7/22/2018 21:19,Rice,Rice,supermarket,"128,000",0,1,2018-07,"128,000"
9446359,2,31885876,7/15/2018 16:17,Rice,Rice,minimarket,"102,750",0,1,2018-07,"102,750"
9470290,3,31930241,7/15/2018 12:12,Rice,Rice,supermarket,"64,000",0,3,2018-07,"192,000"
9643416,4,32418582,7/24/2018 8:27,Rice,Rice,minimarket,"65,000",0,1,2018-07,"65,000"
9692093,5,32561236,7/26/2018 11:28,Rice,Rice,supermarket,"124,500",0,1,2018-07,"124,500"

In [124]:
rice['purchase_time'] = rice['purchase_time'].astype('datetime64[ns]')

In [125]:
rice.dtypes

Unnamed: 0                   int64
receipts_item_id             int64
purchase_time       datetime64[ns]
category                    object
sub_category                object
format                      object
unit_price                 float64
discount                     int64
quantity                     int64
yearmonth                   object
total_price                float64
dtype: object

# <a id='toc11_'></a>[Inclass Questions](#toc0_)

Apa perbedaan `.` dengan `[]` pada konteks subset kolom

- Kedua sintaks tersebut sama-sama bisa digunakan untuk subset kolom


secara detail sudah didokumentasikan pada FAQ berikut: https://askalgo-py.netlify.app/faq/p4da#apa-perbedaan-menuliskan-nama-kolom-menggunakan-tanda-bracket-df-nama-kolom-dengan-pemisah-titik-seperti-df-nama-kolom

In [126]:
rice['category']

receipt_id
9622257    Rice
9446359    Rice
9470290    Rice
9643416    Rice
9692093    Rice
           ...
5760491    Rice
5598782    Rice
5735850    Rice
5678748    Rice
5702411    Rice
Name: category, Length: 12000, dtype: object

In [127]:
rice.category

receipt_id
9622257    Rice
9446359    Rice
9470290    Rice
9643416    Rice
9692093    Rice
           ...
5760491    Rice
5598782    Rice
5735850    Rice
5678748    Rice
5702411    Rice
Name: category, Length: 12000, dtype: object